# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.12-s068_1 on Mon Apr 28 11:58:40 PDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design jpeg_core

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk_i]
set_load -pin_load 0.005 [get_ports inport_accept_o]
set_load -pin_load 0.005 [get_ports outport_valid_o]
set_load -pin_load 0.005 [get_ports {outport_width_o[15]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[14]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[13]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[12]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[11]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[10]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[9]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[8]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_width_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[15]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[14]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[13]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[12]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[11]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[10]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[9]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[8]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_height_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[15]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[14]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[13]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[12]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[11]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[10]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[9]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[8]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_x_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[15]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[14]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[13]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[12]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[11]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[10]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[9]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[8]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_y_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_r_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_g_o[0]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[7]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[6]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[5]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[4]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[3]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[2]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[1]}]
set_load -pin_load 0.005 [get_ports {outport_pixel_b_o[0]}]
set_load -pin_load 0.005 [get_ports idle_o]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rst_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports inport_valid_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_data_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_strb_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_strb_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_strb_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {inport_strb_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports inport_last_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports outport_accept_i]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports inport_accept_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports outport_valid_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_width_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_height_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_x_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_y_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_r_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_g_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {outport_pixel_b_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports idle_o]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__probe_p_8]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__probec_p_8]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbn_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbn_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtn_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_4]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfsbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfsbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_4]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_4]
